[{"stocks": [{"ticker": "AAPL", "price": 237.33, "news": ["Apple Unveils Revolutionary 'iCup' That Charges Your Phone While Keeping Your Coffee Warm!", "Leaked Memo Reveals Apple Staff Once Considered Adding a 'Snooze' Button to the iPhone – Chaos Ensued!"]}, {"ticker": "MSFT", "price": 423.46, "news": ["Microsoft Teams Introduces Virtual Office Pets: Productivity Soars with Adorable Distractions!"]}, {"ticker": "GOOGL", "price": 168.95, "news": ["Google Introduces New Feature: 'WGoogle'—Search for Things You Didn't Know You Lost!", "Alphabet Inc. Faces Major Backlash After Unveiling Plans to Open a 'Smart City' Where No One Can Leave"]}, {"ticker": "AMZN", "price": 207.89, "news": ["Amazon Announces Drone Delivery of Fresh Pizza, Customers Fly High with Excitement!"]}, {"ticker": "META", "price": 574.32, "news": ["Meta Debuts 'Metaverse Catwalk' - Virtual Fashion Shows Go Live with AI-Generated Models!", "Meta's New Privacy Policy Causes Uproar: Users Now Required to Share Pet Names"]}, {"ticker": "TSLA", "price": 345.16, "news": ["Tesla's New 'Energy Sphere' Promises to Power Homes with Zero Emissions—And Zero Explanation!"]}, {"ticker": "BRK-B", "price": 483.02, "news": ["Berkshire Hathaway Announces Historic Investment in Unicorn Startups: Wall Street Left in Awe!", "Warren Buffett Discovers Lasting Love for Board Games, Says Monopoly Should Be Regulated"]}, {"ticker": "JNJ", "price": 155.01, "news": ["Johnson & Johnson Unveils Revolutionary Band-Aid That Promises to Heal Wounds with a Single Application!"]}, {"ticker": "V", "price": 315.08, "news": ["Visa Launches New Contactless Payment Ring: Wedding Bells or Just a Dainty Fad?", "Visa Faces Criticism After System Outage Leaves Millions Unable to Pay for Coffee", "Visa Partners with SpaceX to Enable Intergalactic Transactions—'Mars Needs a Credit Card!'"]}, {"ticker": "WMT", "price": 92.5, "news": ["Walmart Launches 'Check-Out & Chill' Service: Shop While Watching Movies in Store!", "Walmart’s Latest Experiment: Shopping Carts With Built-In Karaoke Machines—Sing Your Stress Away!", "Walmart Faces Criticism Over In-Store Robot Taking Too Many Sudden Breaks"]}], "interest_rate": 0.12, "inflation_rate": 0.55, "gdp_growth_rate": 3.37, "global_news": ["Ambiguous global news", "Ambiguous global news", "Ambiguous global news"], "round_id": "9AS88Z"}, {"stocks": [{"ticker": "AAPL", "price": 245.33, "news": ["Apple's Revolutionary 'iCure' App Claims to Diagnose FOMO with Just a Selfie!", "Apple Under Fire as New MacBook Pro Comes with Fewer Ports Than a Boat Show", "iPhone Users Report Widespread Battery Drain After Latest Update: 'Super Sluggish!'"]}, {"ticker": "MSFT", "price": 428.46, "news": ["Microsoft Teams Breaks Records: 1 Million Users Zoom into a Double-Dare Version of Meetings!"]}, {"ticker": "GOOGL", "price": 166.95, "news": ["Google Announces New Feature: 'Search Your Dreams' for a Better Night's Sleep!", "YouTube's Latest Algorithm Shocker: Cat Videos Outperform Everything Else!"]}, {"ticker": "AMZN", "price": 211.39, "news": ["Amazon Launches Drone Delivery for Pets: Your Dog Can Now Order Treats!", "AMZN Stock Drops After Warehouse Monkey Business Goes Viral"]}, {"ticker": "META", "price": 576.82, "news": ["Meta Unveils Virtual Reality Office Space, Employees Lose Track of Time in Digital Coffee Breaks"]}, {"ticker": "TSLA", "price": 350.16, "news": ["Tesla Launches 'Solar-Powered Roller Skates': Get Fit While You Save the Planet!"]}, {"ticker": "BRK-B", "price": 493.02, "news": ["Berkshire Hathaway Surprises Investors with $10 Billion Investment in a Potato Chip Company!"]}, {"ticker": "JNJ", "price": 160.01, "news": ["Johnson & Johnson Unveils Revolutionary Band-Aid That Heals Minor Cuts... Instantly!"]}, {"ticker": "V", "price": 322.58, "news": ["Visa Launches Revolutionary 'Pay-By-Wink' Technology for Hands-Free Purchases!", "Visa Faces Lawsuit Over Overcharging Users for Unused Monthly Services", "Visa Partners with SpaceX to Enable Intergalactic Transactions by 2027!"]}, {"ticker": "WMT", "price": 97.0, "news": ["Walmart Introduces Grocery Delivery Drones: 'Fly in Your Snacks!'", "Walmart's New 'Self-Checkout' Robots Have a Mind of Their Own: Customers Left Confused"]}], "interest_rate": 0.35, "inflation_rate": 0.65, "gdp_growth_rate": 2.94, "global_news": ["Ambiguous global news", "Ambiguous global news", "Ambiguous global news"], "round_id": "C13NH6"}, {"stocks": [{"ticker": "AAPL", "price": 237.83, "news": ["Apple's New 'iWear' Smart Clothing Line Set to Revolutionize Fashion Tech!", "Apple CEO Accidentally Shares New Product Plans on Instagram: Must-See 'Oops' Moment"]}, {"ticker": "MSFT", "price": 433.46, "news": ["Microsoft Teams Up with NASA for a 'Space Office' Experience: Meetings Now in Zero Gravity!"]}, {"ticker": "GOOGL", "price": 174.95, "news": ["Google Launches 'Google Glasses 2.0': Now with 100% Less Awkwardness!"]}, {"ticker": "AMZN", "price": 213.39, "news": ["Amazon Launches Delivery Drones with Built-In Coffee Maker: Say Goodbye to Wait Time!"]}, {"ticker": "META", "price": 576.82, "news": ["META Unveils Virtual Reality Café: Sip Coffee While Surrounded by Your Favorite Memes!"]}, {"ticker": "TSLA", "price": 358.16, "news": ["Tesla Hits New Highs After Announcing 'Solar-Powered Roads'!", "Elon Musk Tweets About New Cybertruck Features, Mistakenly Promises Flying Car by 2025"]}, {"ticker": "BRK-B", "price": 498.02, "news": ["Berkshire Hathaway Announces 'Investments for Dummies' Seminar—Sign Up or Miss Out on Wisdom!", "Warren Buffett Loses $10 Billion to a Mistaken Investment in Beanie Babies"]}, {"ticker": "JNJ", "price": 165.01, "news": ["Johnson & Johnson Launches Revolutionary 'Pill That Cooks Dinner' Dietary Supplement!", "JNJ Reports Highest Sales in Over Two Decades as New Baby Shampoo Goes Viral!"]}, {"ticker": "V", "price": 339.58, "news": ["Visa Launches 'Tap to Sing' Feature: Pay With Your Voice and Your Heart!"]}, {"ticker": "WMT", "price": 99.0, "news": ["Walmart Unveils Robot Shopping Carts: ‘Your Personal Aisle Assistant!’"]}], "interest_rate": 0.38, "inflation_rate": 0.68, "gdp_growth_rate": 3.38, "global_news": ["Ambiguous global news", "Ambiguous global news", "Ambiguous global news"], "round_id": "2CE0W0"}, {"stocks": [{"ticker": "AAPL", "price": 246.83, "news": ["Apple Introduces Revolutionary 'iFridge' That Keeps Your Food Fresh and Plays Music!", "Close Call: Apple Faces Backlash After iPhone Update Turns Devices into Fancy Paperweights", "Apple's Secret Project 'iTime' Aims to Create the First Smartwatch That Predicts the Future—But It’s Just a Kitchen Timer!"]}, {"ticker": "MSFT", "price": 438.46, "news": ["Microsoft Introduces Revolutionary Feature: 'Undo' for Every Decision Made in Teams Meetings!", "Reports Reveal Microsoft Employees Mistakenly Send Company Secrets to the Wrong Teams Channel", "Outrage as Microsoft's Latest Windows Update Removes Classic Solitaire From Every PC!"]}, {"ticker": "GOOGL", "price": 179.95, "news": ["Google Introduces 'YouTube Time Travel' Feature: Watch Videos from the Future!", "Alphabet’s Latest Experiment: A Search Engine That Only Returns Cat Videos Sparks Controversy"]}, {"ticker": "AMZN", "price": 221.39, "news": ["Amazon Launches Drone Delivery for Daily Groceries: Will Your Milk Arrive with a Side of Comedy?", "Amazon Faces Widespread Outrage After Deliveries Mix Up Baby Formula with Hot Sauce"]}, {"ticker": "META", "price": 584.82, "news": ["Meta Launches 'Metaverse Theme Park' – Visit Virtually, Ride Virtually, Still Get Vertigo!", "Facebook Users Alarmed by New Policy: 'Your Posts Now Powered by AI Fashion Critique'", "Meta's Latest Reality Show: 'Survivor – The Meta Edition' Delays Due to Technical Glitches"]}, {"ticker": "TSLA", "price": 368.16, "news": ["Tesla Surprises with New 'Mini-Me' Electric Car for Kids: Full-Size Features for Tiny Drivers!", "Elon Musk Announces Plans for 'Intra-Galactic FSD': Driving Cars on Mars is the New Frontier!"]}, {"ticker": "BRK-B", "price": 488.02, "news": ["Berkshire Hathaway's Annual Meeting Turns Into Surprise Karaoke Contest: Warren Buffett Stuns Crowd!", "BRK-B Reports Unexpected Losses After Investing in Pet Rock Manufacturing"]}, {"ticker": "JNJ", "price": 187.01, "news": ["Johnson & Johnson Unveils 'Banana-Flavored' Band-Aids: A Sweet New Way to Heal!", "J&J's Latest Vaccine Hits Market but Critics Claim It Tastes Like 'Medicine'", "Johnson & Johnson Faces Lawsuit Over Allegations of Baby Shampoo Gimmickry"]}, {"ticker": "V", "price": 344.58, "news": ["Visa Introduces 'Swipe-to-Smile' Program: Every Card Swipe Donates to Charity!"]}, {"ticker": "WMT", "price": 102.0, "news": ["Walmart Introduces 'Self-Checkout for Pets' Designated Aisles—Fido Can Shop Alone!", "Walmart's New Clothing Line 'Rollback Fashion' Sparks Controversy Over Mixed Reviews"]}], "interest_rate": 0.3, "inflation_rate": 0.77, "gdp_growth_rate": 3.08, "global_news": ["Ambiguous global news", "Ambiguous global news", "Ambiguous global news"], "round_id": "B9UB6H"}]