[{"stocks": [{"ticker": "AAPL", "price": 237.33, "news": ["Apple to Launch 'iToast', A Smart Toaster That Analyzes Your Breakfast Preferences"]}, {"ticker": "MSFT", "price": 423.46, "news": ["Microsoft Surprises World with Revolutionary HoloLens 3: Virtual Reality Now Touchable!", "MSFT Faces Lawsuit Over Alleged Cortana Eavesdropping Scandal", "Microsoft and Netflix Partner up for a New Streaming Service: 'Office Binge'"]}, {"ticker": "GOOGL", "price": 168.95, "news": ["Google's AI Assistant Now Learns New Languages Overnight: Fluent in Whale Speak", "Outrage Grows as Google Maps Inadvertently Reveals Secret Pirate Islands"]}, {"ticker": "AMZN", "price": 207.89, "news": ["Amazon Unveils Drone-Powered Grocery Delivery Service: Fresh Produce at Your Doorstep!", "Supply Chain Snafu: Amazon Packages Accidentally Delivered to the Wrong Continent!", "Amazon's New Employee Policy Faces Criticism: Overnight Shifts Turned 'Into Night Hikes'"]}, {"ticker": "META", "price": 574.32, "news": ["META's Virtual Reality Glasses Now So Realistic, People Forget Which World They're In!"]}, {"ticker": "TSLA", "price": 345.16, "news": ["Tesla to Power Remote Island Entirely with Solar Energy: 'Eco-Dream Come True!'", "Tesla's Autopilot on Standby After Glitch Causes Traffic Jam in Sleepy Town"]}, {"ticker": "BRK-B", "price": 483.02, "news": ["Berkshire Hathaway Invests in Space Tourism: Warren Buffett's Next Big Bet?"]}, {"ticker": "JNJ", "price": 155.01, "news": ["Johnson & Johnson Launches 'Forever Young' Skincare Line with Time-Reversing Technology", "J&J Tackles Alien Bacteria with New Vaccine: Martians Are Next!", "Johnson & Johnson Faces Legal Battle Over Instant Hair Growth Shampoo with Undesirable Side Effects"]}, {"ticker": "V", "price": 315.08, "news": ["Visa Introduces 'Tap-to-Pay with a Smile': New Biometric Technology Turns Frowns into Frauds!", "Rumors Fly as Visa Reportedly in Talks to Accept Payments in Galactic Credits", "Visa Faces Backlash Over Unexpected Fee Hikes: Cardholders in Uproar"]}, {"ticker": "WMT", "price": 92.5, "news": ["Walmart Launches 'Space-Mart': First Retailer on the Moon!", "Walmart Introduces AI Shopping Cart: It Tells You to Stick to Your List!"]}], "interest_rate": 1.03, "inflation_rate": 4.93, "gdp_growth_rate": 2.45, "global_news": ["Ambiguous global news", "Ambiguous global news", "Ambiguous global news"], "round_id": "UM30D8"}, {"stocks": [{"ticker": "AAPL", "price": 237.33, "news": ["Apple Debuts 'Smart Glasses' with Holographic Display: A New Era in Augmented Reality", "iPhone Demand Slumps as Consumers Await Rumored Revolutionary Foldable Model", "Apple Announces Strategic Partnership with Tesla: Welcome to the 'iCar'"]}, {"ticker": "MSFT", "price": 433.46, "news": ["Microsoft Shares Skyrocket After Launch of Holographic Version of Teams!"]}, {"ticker": "GOOGL", "price": 170.45, "news": ["Google AI Program Misfires, Sending Hoax Emails to Search Engine Users Worldwide", "Google Maps' New Feature Set to Predict Traffic Jams Before You Even Leave Home", "GOOGL Faces Massive Fine Over Data Privacy Hearing"]}, {"ticker": "AMZN", "price": 207.89, "news": ["Amazon Debuts 'Drone Delivery Dance Party' - Packages Now Include a Free Light Show!", "Amazon Stock Dips as AI Predicts Package Deliveries Before Items Are Ordered"]}, {"ticker": "META", "price": 585.32, "news": ["META Introduces Augmented Reality Sunglasses That Also Brew Coffee!", "META Faces Backlash as VR World Experiences Major Glitch: 'Avatars Running Wild!'", "META Partners with NASA to Launch Virtual Reality Tours of Mars"]}, {"ticker": "TSLA", "price": 347.16, "news": ["Tesla Unveils Electric Lawn Mower: 'Mow Like Musk' Slogan Sweeps the Nation"]}, {"ticker": "BRK-B", "price": 492.02, "news": ["Berkshire Hathaway Buys Entire Village in Rural America for 'Quaint Living Experience'"]}, {"ticker": "JNJ", "price": 156.01, "news": ["Johnson & Johnson Launches Revolutionary 'Smart Bandage' That Monitors Healing Process in Real Time", "Johnson & Johnson Faces Backlash Over Accidental Release of Baby Shampoo with Minty Fresh Scent", "JNJ's Pharma Division Sees Unexpected Surge in Revenue, Thanks to 'Miracle' Cold Medicine"]}, {"ticker": "V", "price": 310.08, "news": ["Visa Launches Card That Beneficially Rewards Customers with Cryptocurrency Earnings", "Visa Faces Fraud Allegations Over Mysterious Card Charges Worldwide"]}, {"ticker": "WMT", "price": 102.5, "news": ["Walmart Introduces 'Drone Delivery Day'—Shoppers Amazed as Flying Carts Land at Their Doorsteps"]}], "interest_rate": 0.76, "inflation_rate": 4.66, "gdp_growth_rate": 2.57, "global_news": ["Ambiguous global news", "Ambiguous global news", "Ambiguous global news"], "round_id": "L71VS0"}, {"stocks": [{"ticker": "AAPL", "price": 257.33, "news": ["Apple's New iGlasses Hit the Market with Augmented Reality Like Never Before!"]}, {"ticker": "MSFT", "price": 455.13, "news": ["Microsoft Unveils HoloLens 3: A New Era of Augmented Reality Begins!", "Microsoft AI Deemed Too Polite: Users Complain About Excessive Apologies", "Coding Catastrophe: Microsoft Source Code Accidentally Leaked on Social Media"]}, {"ticker": "GOOGL", "price": 161.45, "news": ["GOOGL Announces Quantum Leap Search Engine; Instantly Predicts Your Next Query", "Google's Self-Driving Car Mistakenly Ends Up in Antarctica: 'We Took a Wrong Turn!'", "Internal Memo Leaks: Google Employees Complain Bing is Better for Spam Email Detection"]}, {"ticker": "AMZN", "price": 206.89, "news": ["Amazon Unveils Drone Delivery Service Resembling Miniaturized UFO Fleet"]}, {"ticker": "META", "price": 599.32, "news": ["Meta Launches 'Metaverse Gym': Get Fit Without Leaving Your Virtual Sofa", "Data Breach Scandal Rocks Meta: Virtual Avatars' Secrets Exposed", "Meta to Introduce Ads in Virtual Dreams, Announces Partnership with SleepTech"]}, {"ticker": "TSLA", "price": 352.16, "news": ["Tesla's Mars Rover Surpasses Expectations; Next Stop: Interstellar Travel?"]}, {"ticker": "BRK-B", "price": 492.02, "news": ["Berkshire Hathaway Bets Big on VR Rollercoasters; Warren Buffet Reportedly Dizzy!", "Berkshire Hathaway's Chocolate Monopoly Faces Melted Profits Due to Global Warming"]}, {"ticker": "JNJ", "price": 161.51, "news": ["Johnson & Johnson Reveals Band-Aids That Predict Future Accidents: 'Your Safety Oracle'", "Johnson & Johnson Faces Backlash Over 'Youth Serum' After Consumer Complaints of Skincare Fails", "Johnson & Johnson Partners with NASA to Develop Space-Friendly Toothpaste: Say Goodbye to Earthly Cavities!"]}, {"ticker": "V", "price": 305.08, "news": ["Visa Teams Up with Fictional Nation to Launch 'CryptoCards'—No More Heavy Coins!"]}, {"ticker": "WMT", "price": 105.5, "news": ["Walmart Launches Drone Delivery Service: 'Get Your Groceries Before You Finish Watching an Episode!'", "Shoppers Panic as Rumor Spreads: 'Walmart Considering No Pants Policy'"]}], "interest_rate": 0.87, "inflation_rate": 4.3, "gdp_growth_rate": 2.14, "global_news": ["Ambiguous global news", "Ambiguous global news", "Ambiguous global news"], "round_id": "WKGO3H"}, {"stocks": [{"ticker": "AAPL", "price": 267.33, "news": ["Apple Set to Revolutionize Gaming with Augmented Reality Glasses - Tim Cook Excited"]}, {"ticker": "MSFT", "price": 453.13, "news": ["Microsoft Unveils HoloLens for Pets: Hamsters Enter Virtual Reality"]}, {"ticker": "GOOGL", "price": 164.45, "news": ["Google Introduces 'Search With Smell', Users Can Now Sniff Out Information!", "Google's AI Mistakenly Labels Earth as 'Flat'; Stock Prices Take a Dip"]}, {"ticker": "AMZN", "price": 210.39, "news": ["Amazon Prime Delivers Package Before You Even Order It: Too Fast for Technology?"]}, {"ticker": "META", "price": 590.32, "news": ["Meta Unveils Virtual Reality Dog Park: 'Bringing Real Life Fetch to the Metaverse'", "Investors Concerned as Meta's New Mission Goes from Connecting People to 'Intergalactic Diplomacy'", "Meta Faces Backlash After Algorithm Confuses Baby Pictures with Cat Memes"]}, {"ticker": "TSLA", "price": 369.66, "news": ["Tesla Unveils Solar-Powered Shoes That Charge Phones as You Walk", "Tesla's Latest AI Overhaul Causes Cars to Prefer Scenic Routes — Drivers Missing Meetings"]}, {"ticker": "BRK-B", "price": 490.02, "news": ["Berkshire Hathaway Announces Surprise Investment in Pet Rock Industry: Warren Buffet's Latest Quirk!", "BRK-B Shares Soar as Odd Partnership with Trendy Tech Startup Yields Unexpected Profits", "Investors Concerned as Berkshire Hathaway Loses 'Most Boring Stock' Title with Recent Volatility"]}, {"ticker": "JNJ", "price": 167.51, "news": ["Johnson & Johnson Unveils 'Forever Young' Cream: Celebrities Swear by the Results!", "Controversy Erupts as J&J Latest Product Faces Allegations of Inefficacy"]}, {"ticker": "V", "price": 311.08, "news": ["Visa Partners with Outer Space Payment System: 'Mars, Here We Swipe!'", "Visa Experiments with Crypto Rewards: Critics Wary, Cardholders Enthusiastic", "Data Breach Scares Visa Cardholders. Stocks decline rapidly."]}, {"ticker": "WMT", "price": 107.5, "news": ["Walmart Unveils Revolutionary Drone Delivery Service; Shoppers Await Flying Bargains!"]}], "interest_rate": 1.07, "inflation_rate": 4.56, "gdp_growth_rate": 2.54, "global_news": ["Ambiguous global news", "Ambiguous global news", "Ambiguous global news"], "round_id": "XQ1JEH"}]